# Introduction to Pandas DataFrames
![Pandas](Pandas.webp)

[Pandas](https://pandas.pydata.org/) is a powerful and versatile library for Python, designed primarily for data manipulation and analysis.

> Pandas is the most popular software library for data manipulation and data analysis for the Python programming language. ([www.nvidia.com](https://www.nvidia.com/en-us/glossary/pandas-python/))

## Key Functionalities of Pandas

1. **Data Structures**
   - *Series*: One-dimensional labeled array capable of holding data of any type.
   - *DataFrame*: Two-dimensional, size-mutable, potentially heterogeneous tabular data structure with labeled axes.

2. **Data Manipulation**
   - *Data Selection and Indexing*: `.loc`, `.iloc`, `.at`, `.iat`
   - *Filtering*: Based on conditions
   - *Sorting*: By labels or values
   - *Handling Missing Data*: `isnull`, `dropna`, `fillna`

3. **Data Cleaning**
   - *Dropping Duplicates*
   - *Replacing Values*
   - *String Operations*: `str.split`, `str.replace`

4. **Aggregation and Grouping**
   - *Group By*: `groupby()`
   - *Pivot Tables*

5. **Merging and Joining**
   - *Concatenation*
   - *Merging*: `merge()`, `join()`

6. **Time Series**
   - *Datetime Conversion*
   - *Resampling*
   - *Time-based Indexing*

7. **Statistical and Mathematical Operations**
   - *Descriptive Statistics*
   - *Correlation / Covariance*
   - *Cumulative Operations*

## What is a DataFrame?

A DataFrame is a table-like structure in Pandas that consists of rows and columns, where each column can hold different data types. It can be thought of as a collection of Series objects.

## Creating a DataFrame

There are several ways to create a DataFrame in Pandas, such as:

1. From a Dictionary
2. From a List of Lists
3. From a CSV File

Below are examples of the first two approaches.

In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [2]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

## Accessing Data in a DataFrame

You can access DataFrame content in several ways:

In [3]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [4]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [5]:
df.loc[0, 'Name']

'Alice'